mhdlc/doc/org/metahdl_doc.org
#+title: MetaHDL Manual
#+author: xinmeng@hotmail.com
#+latex_class: book

#+include: "notes/org/export_header.org"

* Introduction
:PROPERTIES:
:CUSTOM_ID: sec:intro
:END:
MetaHDL (shorted as "mhdl" in this document) is an HDL aims at
synthesizable digital VLSI designs (commonly known as RTL designs).
mhdl selectively inherits SystemVerilog
syntax, eliminates unnecessary variants, extends existing
synthesizable language structures and adds new grammars to simplify
RTL coding.  Designers will find it quite intuitive and flexible when
using mhdl.  A compiler named ~mhdlc~ is implemented to translate mhdl
to SystemVerilog or Verilog

** Features
1. Comprehensive Preprocessor

2. Flexible declarations

3. Port inference and automatic variable declarations

4. Enhanced instantiation syntax

5. New syntax for ff and fsm

6. Parameter tracing

7. Automatic dependency resolving

8. Lightweight lint checking

9. Independent Verilog Parser to support IP integration

10. Rich user control syntax

11. Re-indent the generated sv/v

** Document Organization
:PROPERTIES:
:CUSTOM_ID: document-organization
:END:
In the reset of this manual, mhdl syntax and usage will be documented in
detail, following is the organization of this document:

- [[id:f2f5658d-1945-43b7-a88c-681fcf2e89ff][Basic Concepts]] gives many basic and important concepts behind
  mhdl.  All readers are expected to read this chapter carefully,
  otherwise, later chapters are difficult to understand.

- [[id:237209ff-3d5c-49c2-856d-7b29aceff439][Syntax]] gives major syntax explanations and sample codes. After
  reading this chapter, readers can develop complex chips with
  powerful capabilities provided by mhdl.

- [[id:073de3e5-37a1-4eb2-8e38-962cf499beb3][Preprocessor]] describes preprocessor in mhdlc and support
  directives. Designers can achieve script-like code configurations by
  using this build-in preprocessor, instead of writing dozens of
  one-time scripts.

- [[id:abe43d11-89e0-4c42-8502-9d9c56580fd2][User Control]] lists various user control
  variables that alter compiler execution.

- [[id:9daf9027-b8f6-452d-8c3e-0015e8ae6288][Command Line Options]] documents all command line options accepted by
  mhdlc.

- [[id:53a9a0e1-9bc3-4db3-9b87-a9f2d556c12e][For VPerl Designers]] provides additional information for those who
  originally use vperl for daily coding.
  Differences with vperl are summarized there.

- [[id:c1506cb5-e57b-4141-99e0-7126132bca5d][formal syntax]] is the complete formal syntax of mhdl.

** download and bug report
~mhdlc~ is publically available at https://github.com/xinmeng/metahdl.
if you find any bug of mhdlc, ambiguous contents or typo in this
document, please file issue at github. 

* Basic Concepts
:properties:
:id:       f2f5658d-1945-43b7-a88c-681fcf2e89ff
:end:
RTL designs are not like other programming, there are few local
variables.  In addition to physical resources occupation semantics,
RTL variables also represent nets or connections.  Physical elements
are connected via variables.  Normally, there is no floating net
inside modules, which means every net should have source and sinks.
if a net has no source, it should be module input port, which will be
fed by external drivers.  If it has no sink, it should be module
output port, which will drive external modules' signal.  If it has
both source and sinks, it is most probably an internal net.  These are
basic rules of port inference in mhdl.  Designers can override these
rules by adding explicit port declarations.

Module ports are automatically inferred by compiler, and designers can
ask compiler to perform port validation (or port checking) against
designers' explicit declaration.  In this scenario, golden ports are
declared by designers, compiler compares the inferred ports and
declared ports, any missing or newly emerging ports are reported as
error.

In mhdl world, there are *only* four types of building blocks in
synthesizable rtl designs:

1. combinational logic
2. sequential logic (mostly flip-flop)
3. module instantiation
4. FSM.  Technically, FSM is essentially a mixture of combinational
   and sequential logic, because it is so commonly used, we promote it
   to a basic structure.

They are called /code block/ in the rest of this document.  Any
modules, no matter how complex it is, can be decomposed to these four
structures.  Module is treated as a physical resources wrapper with
parameters to be overridden upon instantiation.

mhdl RTL designing is a process in which designers describe
functionalities using code blocks.  ~mhdlc~ connects nets with same
name and infers ports according to designers' declarations.
Parameters are recognized and ports/nets are parameterized
automatically.

mhdl also allows designers to embed script-like code configurations
(via preprocessor) in RTL in a reuse oriented design.  Module logic
can be fine-grain tuned before translating mhdl to SystemVerilog.
Ports and variable declarations are dynamically updated according to
logic configuration.

* Syntax
:properties:
:id:       237209ff-3d5c-49c2-856d-7b29aceff439
:end:
mhdl selectively inherits synthesizable syntax of SystemVerilog,
eliminates unnecessary variants, extends module instantiation syntax,
add new syntax for flip-flop and FSM.  Verilog or SystemVerilog
designers will find it quite intuitive to use mhdl syntax.  In the rest
of this chapter, major syntax are presented with examples, refer to
[[id:c1506cb5-e57b-4141-99e0-7126132bca5d][Formal Syntax]] for complete syntax.

** Combinational Logic
There are two and *only two* types of code block in mhdl for coding
combinational logic, as shown in autoref:code:comb:

1. ~assign~ statement
2. ~always_comb~ statement

#+ATTR_LATEX: :options label={code:comb},frame=single
#+caption: Combinational logic example 
#+begin_src verilog -n
// OK, accepted
always_comb
  if ( enabled )
    o1 = i1 | i2 | i3;
  else
    o1 = 1'b0;

// OK, accepted
assign o2 = cond ? i1 : i2;

// Illegal, wrong!!
// conventional Verilog is NOT supported
always @( i1 or i2 or i3 )
  if ( enabled )
    o1 = i1 | i2 | i3;
  else
    o1 = 1'b0;


// Illegal, wrong!!
// Verilog 2000 is NOT supported, either
always @(*)
  if ( enabled )
    o1 = i1 | i2 | i3;
  else
    o1 = 1'b0;  
#+end_src

