mhdlc/doc/org/metahdl_doc.tex
% Intended LaTeX compiler: pdflatex
\documentclass[10pt,oneside]{book}
\usepackage{MXBookphv}
\makeindex
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{xinmeng@hotmail.com}
\date{2023-11-27}
\title{MetaHDL Manual}
\hypersetup{
 pdfauthor={xinmeng@hotmail.com},
 pdftitle={MetaHDL Manual},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\chapter{Introduction}
\label{sec:org00340b3}
MetaHDL (shorted as "mhdl" in this document) is an HDL aims at
synthesizable digital VLSI designs (commonly known as RTL designs).
mhdl selectively inherits SystemVerilog
syntax, eliminates unnecessary variants, extends existing
synthesizable language structures and adds new grammars to simplify
RTL coding.  Designers will find it quite intuitive and flexible when
using mhdl.  A compiler named \texttt{mhdlc} is implemented to translate mhdl
to SystemVerilog or Verilog

\section{Features}
\label{sec:orgc968f7e}
\begin{enumerate}
\item Comprehensive Preprocessor

\item Flexible declarations

\item Port inference and automatic variable declarations

\item Enhanced instantiation syntax

\item New syntax for ff and fsm

\item Parameter tracing

\item Automatic dependency resolving

\item Lightweight lint checking

\item Independent Verilog Parser to support IP integration

\item Rich user control syntax

\item Re-indent the generated sv/v
\end{enumerate}

\section{Document Organization}
\label{sec:org71a7d4f}
In the reset of this manual, mhdl syntax and usage will be documented in
detail, following is the organization of this document:

\begin{itemize}
\item \hyperref[sec:org0a37dbd]{Basic Concepts} gives many basic and important concepts behind
mhdl.  All readers are expected to read this chapter carefully,
otherwise, later chapters are difficult to understand.

\item \hyperref[sec:org7a8e6f7]{Syntax} gives major syntax explanations and sample codes. After
reading this chapter, readers can develop complex chips with
powerful capabilities provided by mhdl.

\item \hyperref[sec:orga49f1d8]{Preprocessor} describes preprocessor in mhdlc and support
directives. Designers can achieve script-like code configurations by
using this build-in preprocessor, instead of writing dozens of
one-time scripts.

\item \hyperref[sec:org17bead1]{User Control} lists various user control
variables that alter compiler execution.

\item \hyperref[sec:orgcd94bb9]{Command Line Options} documents all command line options accepted by
mhdlc.

\item \hyperref[sec:orgd4e6ee2]{For VPerl Designers} provides additional information for those who
originally use vperl for daily coding.
Differences with vperl are summarized there.

\item \hyperref[sec:orgbcbe461]{formal syntax} is the complete formal syntax of mhdl.
\end{itemize}

\section{download and bug report}
\label{sec:org525a051}
\texttt{mhdlc} is publically available at \url{https://github.com/xinmeng/metahdl}.
if you find any bug of mhdlc, ambiguous contents or typo in this
document, please file issue at github. 

\chapter{Basic Concepts}
\label{sec:org0a37dbd}
RTL designs are not like other programming, there are few local
variables.  In addition to physical resources occupation semantics,
RTL variables also represent nets or connections.  Physical elements
are connected via variables.  Normally, there is no floating net
inside modules, which means every net should have source and sinks.
if a net has no source, it should be module input port, which will be
fed by external drivers.  If it has no sink, it should be module
output port, which will drive external modules' signal.  If it has
both source and sinks, it is most probably an internal net.  These are
basic rules of port inference in mhdl.  Designers can override these
rules by adding explicit port declarations.

Module ports are automatically inferred by compiler, and designers can
ask compiler to perform port validation (or port checking) against
designers' explicit declaration.  In this scenario, golden ports are
declared by designers, compiler compares the inferred ports and
declared ports, any missing or newly emerging ports are reported as
error.

In mhdl world, there are \textbf{only} four types of building blocks in
synthesizable rtl designs:

\begin{enumerate}
\item combinational logic
\item sequential logic (mostly flip-flop)
\item module instantiation
\item FSM.  Technically, FSM is essentially a mixture of combinational
and sequential logic, because it is so commonly used, we promote it
to a basic structure.
\end{enumerate}

They are called \emph{code block} in the rest of this document.  Any
modules, no matter how complex it is, can be decomposed to these four
structures.  Module is treated as a physical resources wrapper with
parameters to be overridden upon instantiation.

mhdl RTL designing is a process in which designers describe
functionalities using code blocks.  \texttt{mhdlc} connects nets with same
name and infers ports according to designers' declarations.
Parameters are recognized and ports/nets are parameterized
automatically.

mhdl also allows designers to embed script-like code configurations
(via preprocessor) in RTL in a reuse oriented design.  Module logic
can be fine-grain tuned before translating mhdl to SystemVerilog.
Ports and variable declarations are dynamically updated according to
logic configuration.

\chapter{Syntax}
\label{sec:org7a8e6f7}
mhdl selectively inherits synthesizable syntax of SystemVerilog,
eliminates unnecessary variants, extends module instantiation syntax,
add new syntax for flip-flop and FSM.  Verilog or SystemVerilog
designers will find it quite intuitive to use mhdl syntax.  In the rest
of this chapter, major syntax are presented with examples, refer to
\hyperref[sec:orgbcbe461]{Formal Syntax} for complete syntax.

\section{Combinational Logic}
\label{sec:org5bdcb1d}
There are two and \textbf{only two} types of code block in mhdl for coding
combinational logic, as shown in \autoref{code:comb}:

\begin{enumerate}
\item \texttt{assign} statement
\item \texttt{always\_comb} statement
\end{enumerate}

\begin{lstlisting}[language=verilog,label= ,caption={Combinational logic example},captionpos=b,firstnumber=1,numbers=left,label={code:comb},frame=single]
// OK, accepted
always_comb
  if ( enabled )
    o1 = i1 | i2 | i3;
  else
    o1 = 1'b0;

// OK, accepted
assign o2 = cond ? i1 : i2;

// Illegal, wrong!!
// conventional Verilog is NOT supported
always @( i1 or i2 or i3 )
  if ( enabled )
    o1 = i1 | i2 | i3;
  else
    o1 = 1'b0;


// Illegal, wrong!!
// Verilog 2000 is NOT supported, either
always @(*)
  if ( enabled )
    o1 = i1 | i2 | i3;
  else
    o1 = 1'b0;  
\end{lstlisting}
