mhdlc/doc/org/metahdl_doc.tex

\section{Sequential Logic}
\label{sec:org1aa85b8}
There are two types of code block in mhdl for coding sequential logic:

\begin{enumerate}
\item \texttt{always\_ff @()} statement, which is same in SystemVerilog
\item \texttt{ff-endff} block, which is introduced by mhdl
\end{enumerate}

The troditional SystemVerilog syntax is good except its redundancy: FF
variable appears twice (even more) in different clause of \texttt{if-else}
branches.  For a multi-bit vector variable, such redundancy is prone
to typo and width mismatch.

For well-coded FF, combinational part of the FF sources should be
coded in a separate code block, so the \texttt{if-else} branches can be
reduced.  mhdl provides a new \texttt{ff-endff} code block to reduce
redundancy.  FF code in following two forms (\autoref{code:ff_blk}) are
equivalent.

\begin{lstlisting}[language=verilog,label= ,caption={ff-endff code block example},captionpos=b,firstnumber=1,numbers=left,label={code:ff_blk}]
// troditional sequential block
always_ff @ (posedge clk or negedge rst_n) 
  if (!rst_n) 
    a_ff <= 1'b0; 
  else
    a_ff <= a;

// MetaHDL new sequential block
ff; 
  a_ff, a, 1'b0; 
endff
\end{lstlisting}


\texttt{ff-endff} block can optionally specify clock and reset signal name.
Usually they are ommitted to further reduce redundancy.  Each
line in block describes a FF.  A line has three element:

\begin{enumerate}
\item FF variable name, \texttt{a\_ff} here.
\item An expression containing the logic to update the FF, \texttt{a} here.  Any
expression defined in \hyperref[sec:orgbcbe461]{Formal Syntax} are allowed here.
\item An optinally reset value.  If no reset value is provided, FF
variable will not be reset.
\end{enumerate}

Here is example:
\begin{lstlisting}[language=verilog,label= ,caption={ff-endff block example and corresponding SystemVerilog},captionpos=b,firstnumber=1,numbers=left]
ff clk_a, clk_a_rst_n;
  a_ff, a, 1'b0;
  b_ff, b;
  c_ff, a_ff & b_ff, 1'b0;
endff

// Generated SystemVerilog from above code
always_ff @(posedge clk_a or negedge clk_a_rst_n)
  if (!clk_a_rst_n) begin
     a_ff <= 1'b0; 
     c_ff <= 1'b0; 
  end 
  else begin
     a_ff <= a; 
     b_ff <= b; 
     c_ff <= a_ff & b_ff; 
  end
\end{lstlisting}


\section{FSM}
\label{sec:orgac0159b}
FSM in conventional RTL design requires many constant/parameter
definitions to improve code readability.  But these definitions are
tedious to maintain during develop iterations, especially for one-hot
encoded FSM.  mhdl introduces \emph{symbol based} FSM programming paradigm
that liberates designers from such frustrated situation.

FSM code block is enclosed by keywords \texttt{fsm}, \texttt{fsm\_nc} and \texttt{endfsm}.
\texttt{fsm} keyword is followed by three identifiers:

\begin{enumerate}
\item FSM name, which is mandatory.
\item clock signal name, which is optional.
\item reset signal name, which is optional, too.
\end{enumerate}

FSM name is used as based name of state register, \texttt{\_cs} and \texttt{\_ns}
suffix are appended to FSM name to create current state register and
next state next state register, respectively.  Clock and reset signal
names are used in sequential block of FSM, which resets state register
and perform current state refreshing.  Clock and reset names can be
omitted together, and default name \texttt{clk} and \texttt{rst\_n} will be used.
State transition is explicitly stated by \texttt{goto} keyword, instead of
next state assignment.

Symbol based FSM programming allows designers to code FSM using state
names, one-hot state encodings are automatically generated by \texttt{mhdlc}.
Constant definitions are generated according to state names to improve
code readability.  To help designers eliminate state name typo, mhdlc
will build a \emph{Directed Graph} representing state transition during
parsing.  By checking the connectivity of every state, dead states and
unreachable states are reported to designers for confirmation.
\autoref{code:fsm_mhdl} is mhdl FSM description, \autoref{code:fsm_sv} is
the corresponding SystemVerilog description, including constant
definition.

\begin{lstlisting}[language=verilog,label= ,caption={FSM code in MetaHDL},captionpos=b,firstnumber=1,numbers=left]
fsm cmdrx, clk, rst_n; 

cm_pim_ack = 1'b0;

IDLE: begin
   if ( pim_cm_req ) begin
      cm_pim_ack = 1'b1; 
      goto DATA; 
   end
   else begin
      goto IDLE; 
   end
end

DATA: begin
   cm_pim_ack = 1'b1; 
   if ( pim_cm_eof ) begin
      cm_pim_ack = 1'b0; 
      goto IDLE; 
   end
   else
     begin
        goto DATA; 
     end
end

endfsm
\end{lstlisting}

\begin{lstlisting}[language=verilog,label= ,caption={FSM code generated in SystemVerilog},captionpos=b,firstnumber=1,numbers=left]
// other declarations...
const logic [1:0] DATA = 2'b10; 
const logic [1:0] IDLE = 2'b01; 
const int _DATA_ = 1; 
const int _IDLE_ = 0;

// Sequential part of cmdrx
always_ff @(posedge clk or negedge rst_n) 
  if( ~rst_n) begin
     cmdrx_cs <= IDLE; 
  end 
  else begin
     cmdrx_cs <= cmdrx_ns;
  end

// Combnational part of cmdrx 
always_comb begin 
   cm_pim_ack = 1'b0;
   unique case ( 1'b1 ) 
     cmdrx_cs[_IDLE_] : begin 
        if ( pim_cm_req ) begin
           cm_pim_ack = 1'b1; 
           cmdrx_ns = DATA; 
        end
        else begin
           cmdrx_ns = IDLE; 
        end
     end

     cmdrx_cs[_DATA_] : begin
        cm_pim_ack = 1'b1; 
        if ( pim_cm_eof ) begin
           cm_pim_ack = 1'b0; 
           cmdrx_ns = IDLE; 
        end
        else begin
           cmdrx_ns = DATA; 
        end
     end

     default: begin 
        cmdrx_ns = 2'hX; 
     end 
   endcase
end
\end{lstlisting}

Difference between \texttt{fsm} and \texttt{fsm\_nc} is Verilog generated from
\texttt{fsm\_nc} block will not contain the sequential block.  That means
designers have to manually code the sequential block.  This is
expecially designed for FSM with synchronous reset.  \textbf{Note} that the
manual crafted sequential block \emph{must} come after the block, because
and signals are only accessible after block is parsed.

\section{Module Instantiation}
\label{sec:org2674b28}
SystemVerilog module instantiation syntax is extended in mhdl, BNF is
shown in \hyperref[sec:orgbcbe461]{Formal Syntax}, start from non-terminal "inst\_block". Features
of mhdl instantiation syntax are highlighted below:

\begin{enumerate}
\item Instance name is optional.  Default instance name created by
prefixeding \texttt{x\_} on module named.
\item Port connection is optional.  Default behavior is to connect ports to
net with identical name.
\item Prefix and/or Suffix connection rules are allowed in port
connection (see example below).
\item Regular expression connection rule is allowed in port connection
(see example below).
\end{enumerate}

\begin{lstlisting}[language=verilog,label= ,caption={Module \texttt{moda} to be instantiated},captionpos=b,firstnumber=1,numbers=left,label={code:moda}]
module moda
  (input i1,
   input i2, 
   output o1, 
   output [1:0] o2
   );

endmodule
\end{lstlisting}

\autoref{code:inst_moda_mhdl} shows different connection rules.
\autoref{code:inst_moda_v} is the generated SystemVerilog. 

\begin{lstlisting}[language=verilog,label= ,caption={Instantiate moda in mhdl},captionpos=b,firstnumber=1,numbers=left,label={code:inst_moda_mhdl}]
// simplest instantiation
moda;

// prefix connection rule
moda x1_moda ( x1_ +);

// suffix connection rule after prefix rule
moda x2_moda ( x2_ + , 
               + _22);

// regexp connection rule
moda x3_moda
  ( "s/o/out/g", 
    "s/i/in/g" );
\end{lstlisting}


\begin{lstlisting}[language=verilog,label= ,caption={Instaniate \texttt{moda}},captionpos=b,firstnumber=1,numbers=left,label={code:inst_moda_v}]
moda x_moda
  (.i1 (i1),
   .i2 (i2),
   .o1 (o1),
   .o2 (o2) );

moda x1_moda
  ( .i1 (x1_i1),
    .i2 (x1_i2),
    .o1 (x1_o1),
    .o2 (x1_o2) );

moda x2_moda
  ( .i1 (x2_i1_22),
    .i2 (x2_i2_22),
    .o1 (x2_o1_22),
    .o2 (x2_o2_22) );

moda x3_moda
  ( .i1 (in1),
    .i2 (in2),
    .o1 (out1),
    .o2 (out2) );
\end{lstlisting}
