mhdlc/doc/org/metahdl_doc.org
** Parameter Tracing
mhdl enables designers to creates parameterized module in two ways:
1. Write parameterized module in MetaHDl from draft.
2. Build parameterized module by instantiating parameterized modules.

To use parameter in mhdl source code, designers declare parameters,
and use them in ports or net.  ~mhdlc~ will automatically parameterize
ports in generated declarations.  If a module to be instantiated is a
parameterized module, ~mhdlc~ can trace parameter usage in port
connections and automatically parameterize nets in wrapper
module. Here are some examples. 


In autoref:code:modc_mhdl, ~modc~ is created in mhdl with parameters.
autoref:code:modc_v is the generated SystemVerilog.  Ports and nets
are properly parameterized. 

#+ATTR_LATEX: :options label={code:modc_mhdl}
#+caption: Coding ~modc~ in mhdl with parameters
#+begin_src verilog -n
parameter A = 4;
parameter B = 5;
parameter C = A + B;

assign o1[C-1:0] = {~i1[A-1:0], i2[B-1:0]};
#+end_src

#+ATTR_LATEX: :options label={code:modc_v}
#+caption: Generated modc.v with parameters
#+begin_src verilog -n 
module modc
  ( i1, i2, o1);

   parameter A = 4; 
   parameter B = 5; 
   parameter C = 4 + 5;

   input [A - 1:0] i1; 
   input [B - 1:0] i2; 
   output [C - 1:0] o1;

   logic [A - 1:0]  i1; 
   logic [B - 1:0]  i2; 
   logic [C - 1:0]  o1;

   assign o1[C - 1:0] = {~i1[A - 1:0], i2[B - 1:0]};

endmodule
#+end_src


In autoref:code:inst_modc_mhdl, ~modc~ is instantiated several times
to demonstrate parameter tracing. 

#+ATTR_LATEX: :options label={code:inst_modc_mhdl}
#+caption: Instantiate ~modc~ in mhdl with parameter override
#+begin_src verilog -n
parameter SETA = 8;
parameter SETB = 9;

modc #(.A(2)) x0_modc ( x0_ + );

modc #(.A (SETA), .B (SETB)) x1_modc ( x1_ + );

modc #(.A (SETA)) x2_modc (x2_ +, .o1 (x2_o1[10:0]));
#+end_src

#+ATTR_LATEX: :options label={code:inst_modc_v}
#+caption: Genrated wrapper with parameter tracing
#+begin_src verilog -n 
module modwrapper
  ( x0_i1, x0_i2, x0_o1, x1_i1, x1_i2, x1_o1, x2_i1, x2_i2, x2_o1);

parameter SETA = 8; 
parameter SETB = 9;

   input  [1 :0]                x0_i1;
   input [4 :0]                 x0_i2;
   output [6 :0]                x0_o1;
   input [SETA - 1:0]           x1_i1;
   input [SETB - 1:0]           x1_i2;
   output [SETA + SETB - 1:0]   x1_o1;
   input [SETA - 1:0]           x2_i1;
   input [4 :0]                 x2_i2;
   output [10 :0]               x2_o1;

   logic [1 :0]                 x0_i1;
   logic [4 :0]                 x0_i2;
   logic [6 :0]                 x0_o1;
   logic [SETA - 1:0]           x1_i1;
   logic [SETB - 1:0]           x1_i2;
   logic [SETA + SETB - 1:0]    x1_o1;
   logic [SETA - 1:0]           x2_i1;
   logic [4 :0]                 x2_i2;
   logic [10 :0]                x2_o1;

   modc #( .A( 2 ), 
           .B( 5 ), 
           .C( 2 + 5 ) ) 
   x0_modc
     ( .i1 (x0_i1),
       .i2 (x0_i2), 
       .o1 (x0_o1) );
   
   modc #( .A( SETA ), 
           .B( SETB ), 
           .C( SETA + SETB ) ) 
   x1_modc
     ( .i1 (x1_i1), 
       .i2 (x1_i2),
       .o1 (x1_o1) );

   modc #( .A( SETA ), 
           .B( 5 ), 
           .C( SETA + 5 ) ) 
   x2_modc
     ( .i1 (x2_i1), 
       .i2 (x2_i2),
       .o1 (x2_o1[10:0]) );

endmodule
#+end_src

** Optional Declaration
Declaration in Verilog and SystemVerilog is mandatory, but in mhdl is
optional.  ~mhdlc~ can automatcially infer width, port directions, and
variable type from a well designed synthesizable RTL code.  But in
some cases, designers want to constrain the inference results.  This can
be done by declaration statements.  Usually, declaration is used in
follow sceanrios:

2. Force port direction, such as
   #+begin_src verilog
input a;
output b;
nonport c;
   #+end_src

3. 2 dimensional array, such as
   #+begin_src verilog
reg [31:0] unpacked_a [15:0];
reg [31:0] [7:0] packed_b;

always_comb begin
   // i will be declared by mhdlc
   for (i=0; i<8; i++)
     packed_b[i] = unpacked_a[i];
end
   #+end_src

