mhdlc/doc/org/metahdl_doc.org
* Preprocessor
:PROPERTIES:
:ID:       073de3e5-37a1-4eb2-8e38-962cf499beb3
:END:
Preprocessor helps designers to embed script-like code configuration
directives into RTL code for reuse oriented designs.  Conventionally,
designers are used to write one-time scripts (Perl/sed/awk/csh) to
preprocess their RTL for using in different project.  This methodology
is not clean enough.  Verification engineers have to create additional
steps in Makefile to preprocess code.  mhdl preprocessor uses
SystemVerilog style macro syntax, introduces more flow control
directives that help designers perform conditional and repetitive
configuration on RTL.

In addition to conventional ~`ifdef~, ~`ifndef~, ~`else~, ~`define~
and ~`include~ macro directives, introduces ~`for~, ~`if~ and ~`let~
to enlarge the power of preprocessor (see following examples).

autoref:code:pp_arb is a simple Round Robin Arbiter FSM implemented in
with facilitating preprocessor.  This arbiter can respond to a
configurable number of slaves, which is controlled by macro
~SLV_NUM~.  Once the code is finished, various arbiters can be
generated by giving different values to ~SLV_NUM~.

#+ATTR_LATEX: :options label={code:pp_arb}
#+caption: Configurable Arbiter in mhdl
#+begin_src verilog -n
fsm arb;

`for (i=1; `i<=`SLV NUM; i++)
slave_grnt_`i = 1'b0;
`endfor

`for (i=1; `i<=`SLV NUM; i++)
 `let j = `i + 1

 `if `i != `SLV NUM
SLAVE_`i: begin
   if ( slave_req_`i ) begin
      slave_grnt_`i = 1'b1;
      if ( slave_eof_`i ) begin
         slave_grnt_`i = 1'b0;
         goto SLAVE_`j;
      end
      else begin
         goto SLAVE_`i;
      end
   end
   else
     goto SLAVE_`j;
end

 `else
SLAVE_`i: begin
   if ( slave_req_`i ) begin
      slave_grnt_`i = 1'b1;
      if ( slave_eof_`i ) begin
         slave_grnt_`i = 1'b0;
         goto SLAVE_1;
      end
      else
        goto SLAVE_`i;
   end
   else
     goto SLAVE_1;
end
 `endif
`endfor
endfsm
#+end_src

A ~`for~ directive is used to repetitively "write" code with slight
difference.  Default values of FSM output are set within this block.

Another ~`for~ directive to write slave handling code, one state for
each slave.  Since it is a Round Robin arbiter, every states perform
same task: grant slave access if has request, move to next slave when
current one has no request or transaction is done, roll back to the
first slave when a arbitration round finishes.  A ~`if~ block is used
to check whether current state is for last slave.

A ~`let~ directive is used to perform arithmetic operation and
calculate value of ~`j~, which is the number of next slave.

autoref:code:pp_arb_v shows te SyntemVerilog generated with ~SLV_NUM=4~.

#+ATTR_LATEX: :options label={code:pp_arb_v}
#+caption: Generated Arbiter in SystemVerilog code (SLV_NUM=4)
#+begin_src verilog -n
module arbiter (
                clock,
                reset_n,
                slave_eof_1,
                slave_eof_2,
                slave_eof_3,
                slave_eof_4,
                slave_grnt_1,
                slave_grnt_2,
                slave_grnt_3,
                slave_grnt_4,
                slave_req_1,
                slave_req_2,
                slave_req_3,
                slave_req_4);


   input clock;
   input reset_n;
   input slave_eof_1;
   input slave_eof_2;
   input slave_eof_3;
   input slave_eof_4;
   output slave_grnt_1;
   output slave_grnt_2;
   output slave_grnt_3;
   output slave_grnt_4;
   input  slave_req_1;
   input  slave_req_2;
   input  slave_req_3;
   input  slave_req_4;

   const logic [3:0] SLAVE_1 = 4'b0001;
   const logic [3:0] SLAVE_2 = 4'b0010;
   const logic [3:0] SLAVE_3 = 4'b0100;
   const logic [3:0] SLAVE_4 = 4'b1000;
   const int         _SLAVE_1_ = 0;
   const int         _SLAVE_2_ = 1;
   const int         _SLAVE_3_ = 2;
   const int         _SLAVE_4_ = 3;
   logic [3:0]       arb_cs;
   logic [3:0]       arb_ns;
   logic             clock;
   logic             reset_n;
   logic             slave_eof_1;
   logic             slave_eof_2;
   logic             slave_eof_3;
   logic             slave_eof_4;
   logic             slave_grnt_1;
   logic             slave_grnt_2;
   logic             slave_grnt_3;
   logic             slave_grnt_4;
   logic             slave_req_1;
   logic             slave_req_2;
   logic             slave_req_3;
   logic             slave_req_4;

   // Sequential part of FSM /tmp/xin_meng/mhdlc/test/arbiter.mhdl:1.0-42.5
   // /tmp/xin_meng/mhdlc/test/arbiter.mhdl:1.0-42.5
   always_ff @(posedge clock or negedge reset_n)
     if (~reset_n) begin
        arb_cs <= SLAVE_1;
     end
     else begin
        arb_cs <= arb_ns;
     end

   // Combnational part of FSM /tmp/xin_meng/mhdlc/test/arbiter.mhdl:1.0-42.5
   // /tmp/xin_meng/mhdlc/test/arbiter.mhdl:1.0-42.5
   always_comb begin
      slave_grnt_1 = 1'b0;
      slave_grnt_2 = 1'b0;
      slave_grnt_3 = 1'b0;
      slave_grnt_4 = 1'b0;
      unique case ( 1'b1 )
        arb_cs[_SLAVE_1_] : begin
           if ( slave_req_1 ) begin
              slave_grnt_1 = 1'b1;
              if ( slave_eof_1 ) begin
                 slave_grnt_1 = 1'b0;
                 arb_ns = SLAVE_2;
              end
              else begin
                 arb_ns = SLAVE_1;
              end
           end
           else begin
              arb_ns = SLAVE_2;
           end
        end

        arb_cs[_SLAVE_2_] : begin
           if ( slave_req_2 ) begin
              slave_grnt_2 = 1'b1;
              if ( slave_eof_2 ) begin
                 slave_grnt_2 = 1'b0;
                 arb_ns = SLAVE_3;
              end
              else begin
                 arb_ns = SLAVE_2;
              end
           end
           else begin
              arb_ns = SLAVE_3;
           end
        end

        arb_cs[_SLAVE_3_] : begin
           if ( slave_req_3 ) begin
              slave_grnt_3 = 1'b1;
              if ( slave_eof_3 ) begin
                 slave_grnt_3 = 1'b0;
                 arb_ns = SLAVE_4;
              end
              else begin
                 arb_ns = SLAVE_3;
              end
           end
           else begin
              arb_ns = SLAVE_4;
           end
        end

        arb_cs[_SLAVE_4_] : begin
           if ( slave_req_4 ) begin
              slave_grnt_4 = 1'b1;
              if ( slave_eof_4 ) begin
                 slave_grnt_4 = 1'b0;
                 arb_ns = SLAVE_1;
              end
              else begin
                 arb_ns = SLAVE_4;
              end
           end
           else begin
              arb_ns = SLAVE_1;
           end
        end

        default: begin
           arb_ns = 4'hX;
        end
      endcase
   end


endmodule   
#+end_src



~`let~ directive supports following functions:

- Numeric operators: addition (~+~), subtraction (~-~), multiplication
  (~*~), division (~/~), modulus (~%~), power (~**~).

- Logical operators: logical AND (~&&~), logical OR (~||~), logical
  NOT (~!~).

- Bit operators: bitwise XOR (~^~), bitwise AND (~&~), bitwise OR (~|~),
  shift right (~>>~), shift left (~<<~).

- Functions: log 2 (~LOG2()~), round up (~CEIL()~), round down (~FLOOR()~),
  round to nearest value (~ROUND()~), max of two numbers (~MAX()~), min of
  two numbers (~MIN()~), odd (~ODD()~), even (~EVEN()~), absolute value
  (~ABS()~).

#+caption: ~`let~ usage examples
#+begin_src verilog -n
`define x 2

// NOTE `let need "="
`let y = `x ** 10 // now `y is 1024

`let z = LOG2(`y) // `z is 10
`let a = LOG2(`z) // `a is 3.321928
`let c = CEIL(`a) // `c is 4
`let f = FLOOR(`a) // `f is 3
`let r = ROUND(`a) // `r is 3


// we can concatenate macro value with other strings
// using "::" operator
assign cat_`f::k = 1'b0; // expand to ``assign cat_3k = 1'b0;''
assign cat_`fk = 1'b0; // Error!! macro ``fk'' is not defined
#+end_src

