mhdlc/doc/org/metahdl_doc.org
* User Control
:PROPERTIES:
:ID:       abe43d11-89e0-4c42-8502-9d9c56580fd2
:END:
mhdl provides control syntax start with keyword ~metahdl~, which
interfaces with and controls the runtime behavior of compiler.
Designers' controls are passed to compiler via variable assignments
embedded in RTL code, this variable settings are also preceded by
keyword ~metahdl~.  Boolean variables inside compiler are set via ~+~
or ~-~ preceded by variable name, where ~+~ means "enable" and ~-~
means "disable".

There are two special form of control syntax: ~exit~ syntax, and
~message~ syntax.  The former is used to command compiler exit when
the statement is encountered.  The latter is used to print messages on
~stderr~.  They are usually used with preprocessor to guarantee
correct configuration settings.  

Working scope of all variables can be /Modular/ or /Effective/.
Modular variables (MVAR) take effect on entire module and are used
when parsing is finished.  Designers can set MVAR anywhere in source
code and get the same effect.  If an MVAR is assigned multiple times,
last assignment wins.  MVAR can have different values in different
files, so file is the minimum granularity of MVAR.

Effective variables (EVAR) take effect from the point the variable is
assigned and are used /during/ parsing.  Designers can set different
values for same EVAR in different sections of source code, and make
compiler treat sections differently.  So the minimum granularity of
EVAR is section divided by EVAR assignments.

** Variable List
Following is the complete list of all compiler variables can be assigned
by user control syntax, variable type (boolean or string) and variable
scope (MVAR or EVAR) are listed with variable name.

#+ATTR_LATEX: :environment longtable  :align |l|c|c|l|p{.45\textwidth}|
#+caption: Compiler Control variables  \label{tab:com_ctrl} 
|-------------------+-------+---------------+----------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| Name              | Scope | Type          | Default        | Description                                                                                                                                                                                                                                                                                                                                                                                                                                                              |
|-------------------+-------+---------------+----------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| modname           | MVAR  | string        | Base file name | Set the generated module name. Often used with preprocessor to distinguish modules with different configurations.                                                                                                                                                                                                                                                                                                                                                        |
| outfile           | MVAR  | string        | Base file name | Set the generated Synthesizable file base name. Often used with preprocessor to distinguish module definition files with different configurations.                                                                                                                                                                                                                                                                                                                       |
| portchk           | MVAR  | boolean       | false          | Enable/Disable port validation for module.                                                                                                                                                                                                                                                                                                                                                                                                                               |
| hierachydepth     | MVAR  | postitive int | 300            | Maximum level of module instantiation.                                                                                                                                                                                                                                                                                                                                                                                                                                   |
| clock             | EVAR  | string        | clock          | Default clock name used for ~ff-endff~ and ~fsm-endfsm~                                                                                                                                                                                                                                                                                                                                                                                                                  |
| reset             | EVAR  | string        | reset_n        | Default reset name used for ~ff-endff~ and ~fsm-endfsm~                                                                                                                                                                                                                                                                                                                                                                                                                  |
| relexedfsm        | EVAR  | boolean       | true           | Set severity of connectivity/reachability error checked in FSM. If it is true, relaxed FSM programming mode is enabled, all dead states or unreachable states are acceptable, compiler only reports warning when such states are encountered, and continues processing. if it is false, FSM programming is in strict mode, any dead state or unreachable state is considered to be fatal error, compiler will report error and stop processing if such state is checked. |
| exitonwarning     | EVAR  | boolean       | false          | Set severity of /normal parsing warning/, such as width mismatch. If it is true, compiler exits on any warning.                                                                                                                                                                                                                                                                                                                                                          |
| exitonlintwarning | EVAR  | boolean       | false          | Warning from port validation, multiple driver checking are categorized as lint warning. If this variable is set to true, compiler will exit on any lint warning.                                                                                                                                                                                                                                                                                                         |
|-------------------+-------+---------------+----------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|


** Example
demonstrates user control syntax with code configuration.

- Line 1 enables port validation in this module.
- Line 3 checks value of macro ~`WIDTH`, forces compilation exit upon
  illegal values.
- Line 16 and 17 alter module name and output file name according to
  target device.
- Any warning between 19 and 29 makes compiler exit.  To be more
  specific, width mismatch between ~b_ff~ and ~b~ is considered to be
  fatal error.
- Different clock and reset names are used for different code sections. 

#+begin_src verilog -n
metahdl + portchk;

`if WIDTH > 64
metahdl ``width can not exceed 64!'';
metahdl exit;
`endif

assign data[`WIDTH-1:0] = `WIDTH'd0;

`ifdef FPGA
 `define target fpga
`else
 `define target asic
`endif

metahdl modname = top_`target;
metahdl outfile = top_`target;

metahdl + exitonwarning;

metahdl clock = clk_125M;
metahdl reset = pclk_rst_n;

ff;
a_ff, a, 1'b0;
b_ff[1:0], b, 1'b0;
endff

metahdl - exitonwarning;

metahdl clock = clk_250M;
metahdl reset = dclk_rst_n;

ff;
c_ff, c, 1'b0;
d_ff, d, 1'b0;
endff

ff;
e_ff, e, 1'b0;
g_ff, g, 1'b0;
endff
#+end_src


* Compiler Usage
