mhdlc/doc/org/metahdl_doc.tex

\chapter{User Control}
\label{sec:org17bead1}
mhdl provides control syntax start with keyword \texttt{metahdl}, which
interfaces with and controls the runtime behavior of compiler.
Designers' controls are passed to compiler via variable assignments
embedded in RTL code, this variable settings are also preceded by
keyword \texttt{metahdl}.  Boolean variables inside compiler are set via \texttt{+}
or \texttt{-} preceded by variable name, where \texttt{+} means "enable" and \texttt{-}
means "disable".

There are two special form of control syntax: \texttt{exit} syntax, and
\texttt{message} syntax.  The former is used to command compiler exit when
the statement is encountered.  The latter is used to print messages on
\texttt{stderr}.  They are usually used with preprocessor to guarantee
correct configuration settings.  

Working scope of all variables can be \emph{Modular} or \emph{Effective}.
Modular variables (MVAR) take effect on entire module and are used
when parsing is finished.  Designers can set MVAR anywhere in source
code and get the same effect.  If an MVAR is assigned multiple times,
last assignment wins.  MVAR can have different values in different
files, so file is the minimum granularity of MVAR.

Effective variables (EVAR) take effect from the point the variable is
assigned and are used \emph{during} parsing.  Designers can set different
values for same EVAR in different sections of source code, and make
compiler treat sections differently.  So the minimum granularity of
EVAR is section divided by EVAR assignments.

\section{Variable List}
\label{sec:orge6b7b18}
Following is the complete list of all compiler variables can be assigned
by user control syntax, variable type (boolean or string) and variable
scope (MVAR or EVAR) are listed with variable name.

\begin{longtable}{|l|c|c|l|p{.45\textwidth}|}
\caption{Compiler Control variables  \label{tab:com_ctrl}}
\\[0pt]
\hline
\rowcolor{ThemeColor}\tableheader{Name} & \tableheader{Scope} & \tableheader{Type} & \tableheader{Default} & \tableheader{Description}\\[0pt]
\hline
\endfirsthead
\multicolumn{5}{l}{Continued from previous page} \\[0pt]
\hline

\rowcolor{ThemeColor}\tableheader{Name} & \tableheader{Scope} & \tableheader{Type} & \tableheader{Default} & \tableheader{Description }\\[0pt]

\hline
\endhead
\hline\multicolumn{5}{r}{Continued on next page} \\
\endfoot
\endlastfoot
\hline
modname & MVAR & string & Base file name & Set the generated module name. Often used with preprocessor to distinguish modules with different configurations.\\[0pt]
outfile & MVAR & string & Base file name & Set the generated Synthesizable file base name. Often used with preprocessor to distinguish module definition files with different configurations.\\[0pt]
portchk & MVAR & boolean & false & Enable/Disable port validation for module.\\[0pt]
hierachydepth & MVAR & postitive int & 300 & Maximum level of module instantiation.\\[0pt]
clock & EVAR & string & clock & Default clock name used for \texttt{ff-endff} and \texttt{fsm-endfsm}\\[0pt]
reset & EVAR & string & reset\_n & Default reset name used for \texttt{ff-endff} and \texttt{fsm-endfsm}\\[0pt]
relexedfsm & EVAR & boolean & true & Set severity of connectivity/reachability error checked in FSM. If it is true, relaxed FSM programming mode is enabled, all dead states or unreachable states are acceptable, compiler only reports warning when such states are encountered, and continues processing. if it is false, FSM programming is in strict mode, any dead state or unreachable state is considered to be fatal error, compiler will report error and stop processing if such state is checked.\\[0pt]
exitonwarning & EVAR & boolean & false & Set severity of \emph{normal parsing warning}, such as width mismatch. If it is true, compiler exits on any warning.\\[0pt]
exitonlintwarning & EVAR & boolean & false & Warning from port validation, multiple driver checking are categorized as lint warning. If this variable is set to true, compiler will exit on any lint warning.\\[0pt]
\hline
\end{longtable}


\section{Example}
\label{sec:org7f63deb}
demonstrates user control syntax with code configuration.

\begin{itemize}
\item Line 1 enables port validation in this module.
\item Line 3 checks value of macro \textasciitilde{}`WIDTH`, forces compilation exit upon
illegal values.
\item Line 16 and 17 alter module name and output file name according to
target device.
\item Any warning between 19 and 29 makes compiler exit.  To be more
specific, width mismatch between \texttt{b\_ff} and \texttt{b} is considered to be
fatal error.
\item Different clock and reset names are used for different code sections.
\end{itemize}

\begin{lstlisting}[language=verilog,label= ,caption= ,captionpos=b,firstnumber=1,numbers=left]
metahdl + portchk;

`if WIDTH > 64
metahdl ``width can not exceed 64!'';
metahdl exit;
`endif

assign data[`WIDTH-1:0] = `WIDTH'd0;

`ifdef FPGA
 `define target fpga
`else
 `define target asic
`endif

metahdl modname = top_`target;
metahdl outfile = top_`target;

metahdl + exitonwarning;

metahdl clock = clk_125M;
metahdl reset = pclk_rst_n;

ff;
a_ff, a, 1'b0;
b_ff[1:0], b, 1'b0;
endff

metahdl - exitonwarning;

metahdl clock = clk_250M;
metahdl reset = dclk_rst_n;

ff;
c_ff, c, 1'b0;
d_ff, d, 1'b0;
endff

ff;
e_ff, e, 1'b0;
g_ff, g, 1'b0;
endff
\end{lstlisting}
