mhdlc/doc/org/metahdl_doc.org
** Command Line Options
:PROPERTIES:
:ID:       9daf9027-b8f6-452d-8c3e-0015e8ae6288
:END:
~mhdlc~ command line is listed below:
#+begin_example
% mhdlc <options> mhdl_file [mhdl_file mhdl_file ...]
#+end_example

Command line captions are case sensitive, which means ~-p~ and ~-P~
are different.  Major options are listed below:

1. ~-I~ Specify single search path for ~mhdlc~ to look for ~`include~
   files.

2. ~-o~ Specify output base directory for generated files.  mhdl source
   directory structure is mirrored under it.

3. ~-D~ Define macro from command line. e.g., ~-DCMD_EN~ defines a
   macro named ~CMD_EN~, ~-DSLV_NUM=4~ defines a macro ~SLV_NUM~ with
   ~4~ as its value.

4. ~-mb~ specify mhdl source base directory.  All mhdl files are
   searched recursively from this directory.  ~-mb~ can only be
   specified once, multiple values are not allowed. 

5. ~-ib~ specify IP base directories, which contain existing verilog
   designs.  Multiple ~-ib~ can be spcified at command line.

All other text in command line and does not start with "-" are
considered to be file names to be processed.

** For VPerl Designers
:PROPERTIES:
:ID:       53a9a0e1-9bc3-4db3-9b87-a9f2d556c12e
:END:

1. ~&Depend~ is no longer needed since automatically resolves
   dependency.

2. ~vpmake -depend~ is not needed anymore, just give top level file and
   search path.

3. All ~&Force~ should be converted to standard declarations, including
   2D array.

4. ~&ConnRule~ and ~&Connect~ should be converted according to port
   connect syntax.

5. ~&Instance~ should be converted to instantiation syntax.

6. ~c-sky vperl_off~ and ~c-sky vperl_on~ should be converted to
   ~rawcode~ and ~endrawcode~.

7. File extension is ~.mhdl~, not ~.vp~ .


* Formal Syntax
:PROPERTIES:
:ID:       c1506cb5-e57b-4141-99e0-7126132bca5d
:END:
\input{formal_syntax.tex}


