mhdlc/doc/org/metahdl_doc.tex


\chapter{Compiler Usage}
\label{sec:org32ec4ba}
\section{Command Line Options}
\label{sec:orgcd94bb9}
\texttt{mhdlc} command line is listed below:
\begin{verbatim}
% mhdlc <options> mhdl_file [mhdl_file mhdl_file ...]
\end{verbatim}

Command line captions are case sensitive, which means \texttt{-p} and \texttt{-P}
are different.  Major options are listed below:

\begin{enumerate}
\item \texttt{-I} Specify single search path for \texttt{mhdlc} to look for \texttt{`include}
files.

\item \texttt{-o} Specify output base directory for generated files.  mhdl source
directory structure is mirrored under it.

\item \texttt{-D} Define macro from command line. e.g., \texttt{-DCMD\_EN} defines a
macro named \texttt{CMD\_EN}, \texttt{-DSLV\_NUM=4} defines a macro \texttt{SLV\_NUM} with
\texttt{4} as its value.

\item \texttt{-mb} specify mhdl source base directory.  All mhdl files are
searched recursively from this directory.  \texttt{-mb} can only be
specified once, multiple values are not allowed.

\item \texttt{-ib} specify IP base directories, which contain existing verilog
designs.  Multiple \texttt{-ib} can be spcified at command line.
\end{enumerate}

All other text in command line and does not start with "-" are
considered to be file names to be processed.

\section{For VPerl Designers}
\label{sec:orgd4e6ee2}
\begin{enumerate}
\item \texttt{\&Depend} is no longer needed since automatically resolves
dependency.

\item \texttt{vpmake -depend} is not needed anymore, just give top level file and
search path.

\item All \texttt{\&Force} should be converted to standard declarations, including
2D array.

\item \texttt{\&ConnRule} and \texttt{\&Connect} should be converted according to port
connect syntax.

\item \texttt{\&Instance} should be converted to instantiation syntax.

\item \texttt{c-sky vperl\_off} and \texttt{c-sky vperl\_on} should be converted to
\texttt{rawcode} and \texttt{endrawcode}.

\item File extension is \texttt{.mhdl}, not \texttt{.vp} .
\end{enumerate}


\chapter{Formal Syntax}
\label{sec:orgbcbe461}
\input{formal_syntax.tex}
\end{document}
